
* Script.py
#+begin_src python :results output
  actual = [1, 0, 0, 1, 1, 1, 0, 1, 1, 1]
  predicted = [0, 1, 1, 1, 1, 0, 1, 0, 1, 0]

  true_positives = 0
  true_negatives = 0
  false_positives = 0
  false_negatives = 0

  for i in range(len(predicted)):
    if actual[i] == 1 and predicted[i] == 1:
      true_positives += 1
    if actual[i] == 0 and predicted[i] == 0:
      true_negatives += 1
    if actual[i] == 0 and predicted[i] == 1:
      false_positives += 1
    if actual[i] == 1 and predicted[i] == 0:
      false_negatives += 1

  precision = true_positives / (true_positives + false_positives)
  print(f'precision: {precision}')

  recall = true_positives / (true_positives + false_negatives)
  print(f'recall: {recall}')

  f_1 = 2 * (precision * recall) / (precision + recall)
  print(f'f1-score: {f_1}')
#+end_src

#+RESULTS:
: precision: 0.5
: recall: 0.42857142857142855
: f1-score: 0.4615384615384615

* Script.py
#+begin_src python :results output
  from sklearn.metrics import accuracy_score, recall_score, precision_score, f1_score

  actual = [1, 0, 0, 1, 1, 1, 0, 1, 1, 1]
  predicted = [0, 1, 1, 1, 1, 0, 1, 0, 1, 0]

  accuracy = accuracy_score(actual, predicted)
  print(accuracy)

  recall = recall_score(actual, predicted)
  print(recall)

  precision = precision_score(actual, predicted)
  print(precision)

  f_1 = f1_score(actual, predicted)
  print(f_1)

#+end_src

#+RESULTS:
: 0.3
: 0.42857142857142855
: 0.5
: 0.4615384615384615
